app/controllers/categories_controller.rb

	def index

		@categories = Category.paginate(page: params[:page], per_page: 5).order('title DESC')
---
SELECT COUNT(*) FROM `categories`
SELECT `categories`.* FROM `categories` ORDER BY title ASC, title DESC LIMIT 5 OFFSET 0

	def products

		if params[:zip]
	  		zip = params[:zip]
	      session[:zip] = zip
	  	elsif session[:zip]
	      zip = session[:zip]
	  	else
	    	zip = '94123'
	      session[:zip] = zip
	  	end

	    @category = Category.find(params[:slug])
	    search = ''
	  	@location = Location.near("#{zip}", 20).collect{|c| c.id}.join(',')


	    if @location !=''
	    	if user_signed_in?
		  		@products = Product.search_products().categoryfilter(@category.id).sortorder().first(20)
		  	else
		  		@products = Product.search_products().categoryfilter(@category.id).sortorder().first(12)
		  	end
		  @products_locations =  Product.search_products(@location).categoryfilter(@category.id).collect{|c| c.location_id}.join(',')
		  @brand_ids =  Product.search_products().categoryfilter(@category.id).collect{|b| b.brand_id}.join(',')
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`slug` = 'ice-cream' ORDER BY title ASC LIMIT 1
SELECT locations.*, 6371.0 * 2 * ASIN(SQRT(POWER(SIN((25.783312 - locations.latitude) * PI() / 180 / 2), 2) + COS(25.783312 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-80.1484407 - locations.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((locations.longitude - -80.1484407) / 57.2957795), ((locations.latitude - 25.783312) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM `locations` WHERE (locations.latitude BETWEEN 25.603447678816252 AND 25.963176321183745 AND locations.longitude BETWEEN -80.34819106957987 AND -79.94869033042012 AND (6371.0 * 2 * ASIN(SQRT(POWER(SIN((25.783312 - locations.latitude) * PI() / 180 / 2), 2) + COS(25.783312 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-80.1484407 - locations.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 20) ORDER BY distance ASC
SELECT `brands`.* FROM `brands` WHERE `brands`.`id` = 4286 LIMIT 1

		  @brands = Brand.where("id in (#{@brand_ids})")
	    end

	   	@sliders = Slider.all
---
SELECT `sliders`.* FROM `sliders`