app/controllers/home_controller.rb

SELECT locations.*, 6371.0 * 2 * ASIN(SQRT(POWER(SIN((37.8020405 - locations.latitude) * PI() / 180 / 2), 2) + COS(37.8020405 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-122.4382307 - locations.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((locations.longitude - -122.4382307) / 57.2957795), ((locations.latitude - 37.8020405) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM `locations` WHERE (locations.latitude BETWEEN 37.622176178816254 AND 37.98190482118374 AND locations.longitude BETWEEN -122.66586867900556 AND -122.21059272099446 AND (6371.0 * 2 * ASIN(SQRT(POWER(SIN((37.8020405 - locations.latitude) * PI() / 180 / 2), 2) + COS(37.8020405 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-122.4382307 - locations.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 20) ORDER BY distance ASC
SELECT `sliders`.* FROM `sliders`
---
  def index

  	if params[:zip]
  		zip = params[:zip]
      session[:zip] = zip
  	else
    	zip = '94123'
      session[:zip] = zip
  	end
    zip = '94123'

    search = ''
  	@location = Location.near("#{zip}", 20).collect{|c| c.id}.join(',')

    if @location !=''
	  @products = Product.sort_by_rating(@location,search)
    @products_locations = Product.sort_by_rating(@location,search).collect{|c| c.location_id}.join(',')
    if @products_locations!=''
    @locations = Location.where("id in (#{@products_locations})")
    end
    else
    @locations = Location.near("#{zip}", 20)
    @products = Product.sort_by_rating('',search)
    end

   	@sliders = Slider.all