app/controllers/products_controller.rb

def more_details

	if params[:zip]
      zip = params[:zip]
      session[:zip] = zip
    elsif session[:zip]
      zip = session[:zip]
    else
      zip = '94123'
      session[:zip] = zip
    end
    location = Location.near("#{zip}", 200).collect{|c| c.id}.join(',')

	@product = Product.find(params[:slug])
---
SELECT locations.*, 6371.0 * 2 * ASIN(SQRT(POWER(SIN((37.8020405 - locations.latitude) * PI() / 180 / 2), 2) + COS(37.8020405 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-122.4382307 - locations.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((locations.longitude - -122.4382307) / 57.2957795), ((locations.latitude - 37.8020405) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM `locations` WHERE (locations.latitude BETWEEN 36.00339728816254 AND 39.600683711837455 AND locations.longitude BETWEEN -124.71461049005546 AND -120.16185090994455 AND (6371.0 * 2 * ASIN(SQRT(POWER(SIN((37.8020405 - locations.latitude) * PI() / 180 / 2), 2) + COS(37.8020405 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-122.4382307 - locations.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 200) ORDER BY distance ASC
SELECT `products`.* FROM `products` WHERE `products`.`slug` = '100-whole-grain-organic-sprouted-barley' LIMIT 1

def add_to_favorites

	@already_exists = Fovorite.where(user_id:current_user.id).where(reference_id: params[:product_id]).where(type: "Product").count
	if @already_exists < 1
	@favorite = Fovorite.create(user_id:current_user.id, type: "Product", reference_id: params[:product_id])
---
SELECT COUNT(*) FROM `fovorites` WHERE `fovorites`.`user_id` = 1 AND `fovorites`.`reference_id` = 27336 AND `fovorites`.`type` = 'Product'
INSERT INTO `fovorites` (`created_at`, `reference_id`, `type`, `updated_at`, `user_id`) VALUES ('2014-10-18 08:41:00', 27336, 'Product', '2014-10-18 08:41:00', 1)

def add_comments

	@already_exists = Rating.where(user_id:current_user.id).where(ratable_id: params[:ratable_id]).where(ratable_type: "Product").count
	if @already_exists < 1
	@comment = Rating.create(user_id:current_user.id, ratable_type: "Product", ratable_id: params[:ratable_id], comment: params[:comment] )
---
SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`user_id` = 1 AND `ratings`.`ratable_id` = 27336 AND `ratings`.`ratable_type` = 'Product'
INSERT INTO `ratings` (`comment`, `created_at`, `ratable_id`, `ratable_type`, `rating`, `updated_at`, `user_id`) VALUES ('test test test', '2014-10-18 13:22:06', 30378, 'Product', NULL, '2014-10-18 13:22:06', 1)

def add_flag

	@flag = FlagRequest.create(user_id:current_user.id, flaggable_type: "Product", flaggable_id: params[:product_id], comment: params[:comment] )
---
INSERT INTO `flag_requests` (`comment`, `created_at`, `flaggable_id`, `flaggable_type`, `updated_at`, `user_id`) VALUES ('test', '2014-10-18 10:27:41', 27336, 'Product', '2014-10-18 10:27:41', 1)