app/controllers/searches_controller.rb

SELECT locations.*, 6371.0 * 2 * ASIN(SQRT(POWER(SIN((40.1679706 - locations.latitude) * PI() / 180 / 2), 2) + COS(40.1679706 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-77.4013403 - locations.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((locations.longitude - -77.4013403) / 57.2957795), ((locations.latitude - 40.1679706) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM `locations` WHERE (locations.latitude BETWEEN 38.36932738816254 AND 41.966613811837455 AND locations.longitude BETWEEN -79.75510247521063 AND -75.04757812478937 AND (6371.0 * 2 * ASIN(SQRT(POWER(SIN((40.1679706 - locations.latitude) * PI() / 180 / 2), 2) + COS(40.1679706 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-77.4013403 - locations.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 200) ORDER BY distance ASC
---
  def index
    if params[:zip]
    zip = params[:zip]
    session[:zip] = zip
    else
      zip = session[:zip]
    end
    @location = Location.near("#{zip}", 100).collect{|c| c.id}.join(',')

SELECT brands.* FROM `brands` LEFT OUTER JOIN brands_locations ON brands_locations.brand_id = brands.id WHERE (brands_locations.location_id in (5751)) AND (brands.name LIKE '%%') GROUP BY brands.id ORDER BY brands.name asc LIMIT 20
---
        end
        if @product_ids!=''
          @products = Product.search_products().where("products.id in (#{@product_ids})").paginate(page: 1, per_page: 30).sortorder(sort)
          @brandids2 = Product.search_products().where("products.id in (#{@product_ids})").collect{|c| c.brand_id}.join(',')