app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'rmarktest@gmail.com' ORDER BY name ASC LIMIT 1
UPDATE `users` SET `last_sign_in_at` = '2014-10-16 13:10:33', `current_sign_in_at` = '2014-10-18 08:40:47', `sign_in_count` = 36, `updated_at` = '2014-10-18 08:40:47' WHERE `users`.`id` = 1
---
def create
    if params[:facebook_id]
      resource = User.where(:email => params[:email], :facebook_id => params[:facebook_id]).first
      if resource.nil?
        resource = User.where(:email => params[:email]).first
        if resource.nil?
          resource = User.create!(:email => params[:email], :facebook_id => params[:facebook_id], :password => "empty1234")
          params[:user].delete(:id)
          params[:user].delete(:created_at)
          params[:user].delete(:active_subscription)
          params[:user][:avatar] = open(params[:user][:avatar])
          resource.update_attributes!(params[:user])