app/views/products/more_details.html.erb


    $('.comment_post a').click(function(){


        if($(".divClass").attr("data-webRating") < 1){
          $(".alert_text").html("Rating should not be empty");
          $(".alert_overlay").fadeIn();

        }else if($(".leave_cmt").val()!=''){
        $.get('/products/addrating', { ratable_id:<%= @product.id %>,comment:$(".leave_cmt").val(),rating:$(".divClass").attr("data-webRating")}, null, "script");

        }else{

        $(".alert_text").html("Comment should not be empty");
        $(".alert_overlay").fadeIn();
       }
        return false;


     });
---
SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`ratable_id` = 27336