app/views/layouts/_useractions.html.erb

SELECT locations.*, 6371.0 * 2 * ASIN(SQRT(POWER(SIN((37.8020405 - locations.latitude) * PI() / 180 / 2), 2) + COS(37.8020405 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-122.4382307 - locations.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((locations.longitude - -122.4382307) / 57.2957795), ((locations.latitude - 37.8020405) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM `locations` WHERE (locations.latitude BETWEEN 36.00339728816254 AND 39.600683711837455 AND locations.longitude BETWEEN -124.71461049005546 AND -120.16185090994455 AND (6371.0 * 2 * ASIN(SQRT(POWER(SIN((37.8020405 - locations.latitude) * PI() / 180 / 2), 2) + COS(37.8020405 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-122.4382307 - locations.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 200) ORDER BY distance ASC
---
                                   <div class="cus_select_rslt">
                                     <%= f.select(:location_type, Location::TYPES, :prompt => "Select Type") %>